#+BEGIN_EXPORT html
---
layout: post
title: defλ
---
#+END_EXPORT
#+TITLE: defλ
#+OPTIONS: toc:nil
#+EXPORT_FILE_NAME: ../_posts/2022-10-19-defλ.md

** Preliminaries: Functional Arguments and Procedure Calls
Let's look at an actual example of the kind of thing we'd like to write:
#+Begin_src lisP
(defλ some-fn
  [x0 x1 x2 x3 & x4]
  (some-stuff x1 x3)
  (compute-return-value x0 x4))
#+end_src

#+RESULTS:
: [x0 x1 x2 x3 & x4]

Becomes something like:
#+begin_src asm
    .text
    .global some-fn
some-fn:
    /* store frame pointer and return address on stack */
    stp x29, x30 [sp, #-32]!
    /* store stack pointer as new frame pointer */
    mov x29, [sp]

    /* <evaluation of arguments goes here> */

    /* store all the arguments on the stack*/
    stp x0, x1 [sp, #-32]!
    stp x2, x3 [sp, #-32]!
    str x4 [sp, #-16]

    /* getting the arguments for some-stuff and calling it */
    ldr x0, [sp], #64         // get x1 (second arg)
    ldr x1, [sp], #32         // get x3 (fourth arg)
    bl some-stuff             // call some-stuff

    /* getting the arguments for compute-return-value and calling it */
    ldr x0, [sp], #80         // get x0 (first arg)
    ldr x1, [sp], #16         // get x4 (& args)
    bl compute-return-value   // call compute-return-value

    /* pointer to return value is placed in x0 by compute-return-value */

    ldp x29, x30, [sp], #112 /* get back frame pointer and return address */
    ret /* return to point in x30 */
#+end_src

[[https://diveintosystems.org/book/C9-ARM64/functions.html][This resource]] was very helpful in understanding how one might handle procedure calls.

